W6D3/routes_project/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "andy"], ["email", "andy@gmail.com"]]
---
    def create
    user = User.new(params.require(:user).permit(:username))
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "rosemary gonzaga"], ["email", "rosemary@gmail.com"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])

        if @user.update(user_params)