W7D2/music_app/app/models/user.rb

    def self.find_by_credentials(email,password)
        user = self.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "leomessi87@gmail.com"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = self.class.generate_session_token
        self.save
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "uQKYUDF-KwQXZDqJq8bplA"], ["id", 3]]