W7D2/music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "leomessi87@gmail.com"], ["password_digest", "$2a$12$TZSD9N26EIb8XG0BDDcSj.n3.pr.MGtRGg4SYMcq9U7GV7tVsnfs2"], ["session_token", "eCyXDJN2O4HpwTmMFv5JXw"]]
---
    def create
        p params
        user = User.new(user_params)
        if user.save