W10D5/Td Will Copy/app/controllers/api/todos_controller.rb

    def index
        # debugger
        @todos = Todo.all
---
SELECT "todos".* FROM "todos"