W10D5/todos/app/controllers/api/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        # debugger
        render json: Todo.find(params[:id])

INSERT INTO "todos" ("id", "title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["id", 1595119240563], ["title", "make lunch"], ["body", "make lunch"], ["done", false], ["created_at", "2020-07-19 00:40:40.574587"], ["updated_at", "2020-07-19 00:40:40.574587"]]
---
    def create
        # debugger
        @todo = Todo.new(todo_params)
        if @todo.save

SELECT "todos".* FROM "todos"
---
    def index
        # debugger
        @todos = Todo.all